Autodesk.Revit.DB.FabricationPart.GetProductListSizes
Gets the available sizes for this product list fabrication part.
Each entry in the returned set has a SizeString matching the FABRICATION_PRODUCT_ENTRY parameter,
along with WidthDiameter, Depth, and ProfileType for building Profile objects.
Returns:
The set of available sizes. Empty if none could be read.
Since:
2016

Autodesk.Revit.DB.FabricationPart.SetStiffenerInfo(System.Int32,System.Int32,System.Boolean)
Sets the stiffener information for the fabrication part.
index:
The index of the stiffener to set.
stiffenerId:
The identifier of the stiffener to set.
locked:
If true the stiffener will be locked and not changed by automatic processes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The stiffener identifier is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The stiffener index is out of range.
Since:
2027

Autodesk.Revit.DB.FabricationPart.GetStiffenerInfo(System.Int32,System.Boolean@)
Gets the stiffener information for the fabrication part.
index:
The index of the stiffener to get.
locked:
The locked status to be returned.
Returns:
Returns the database identifier of the stiffener.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The stiffener index is out of range.
Since:
2027

Autodesk.Revit.DB.FabricationPart.GetStiffenerCount
Gets the number of stiffeners for the fabrication part.
Since:
2027

Autodesk.Revit.DB.FabricationPart.SetAirturnInfo(System.Int32,System.Int32,System.Boolean)
Sets the air turn information for the fabrication part.
index:
The index of the air turn to set.
airturnId:
The identifier of the air turn to set.
locked:
If true the air turn will be locked and not changed by automatic processes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The air turn identifier is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The air turn index is out of valid range.
Since:
2027

Autodesk.Revit.DB.FabricationPart.GetAirturnInfo(System.Int32,System.Boolean@)
Gets the air turn information for the fabrication part.
index:
The index of the air turn to get.
locked:
The locked status to be returned.
Returns:
Returns the database identifier of the air turn.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The air turn index is out of valid range.
Since:
2027

Autodesk.Revit.DB.FabricationPart.GetAirturnCount
Gets the number of air turns for the fabrication part.
Since:
2027

Autodesk.Revit.DB.FabricationPart.SetSeamInfo(System.Int32,System.Int32,System.Boolean)
Sets the seam information for the fabrication part.
seamIndex:
The index of the seam to set.
seamId:
The identifier of the seam to set.
locked:
If true the seam will be locked and not changed by automatic processes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The seam identifier is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The seam index is out of valid range.
Since:
2027

Autodesk.Revit.DB.FabricationPart.GetSeamInfo(System.Int32,System.Boolean@)
Gets the seam information for the fabrication part.
seamIndex:
The index of the seam to get.
locked:
The locked status to be returned.
Returns:
Returns the database identifier of the seam.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The seam index is out of valid range.
Since:
2027

Autodesk.Revit.DB.FabricationPart.GetSeamCount
Gets the number of seams for the fabrication part.
Since:
2027

Autodesk.Revit.DB.FabricationPart.SetOptionValue(Autodesk.Revit.DB.FabricationOptionDefinition,System.Double)
Sets the fabrication option to the specified value.
option:
The fabrication option to set.
newValue:
The new value to set, in Revit internal units.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The fabrication option is not modifiable.
-or-
The value is invalid if it is beyond the defined limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.FabricationPart.GetOptionValue(Autodesk.Revit.DB.FabricationOptionDefinition)
Gets the value of specified fabrication option definition.
option:
The fabrication option to get.
Returns:
The value to be returned, in the Revit internal units.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetOptionDefinitions
Gets a copy of current fabrication option definitions.
Returns:
Returns an array of fabrication options.
Since:
2027

Autodesk.Revit.DB.FabricationPart.GetOptionCount
Gets the number of fabrication options for this part.
Returns:
0 if the part has no option data exposed in Revit.
Since:
2027

Autodesk.Revit.DB.FabricationPart.GetDimensionDefinitions
Gets a copy of current fabrication dimension definitions.
Returns:
Returns an array of fabrication dimension definitions.
Since:
2027

Autodesk.Revit.DB.FabricationPart.GetAllFabricationDoubleWallConnectorDefinitions(Autodesk.Revit.DB.Connector)
Gets all connectors that are valid to be assigned to the part for a specified double wall connector
connector:
The connector to to check against
Returns:
Returns an array of connector database identifiers
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.FabricationPart.GetAllFabricationBodyConnectorDefinitions(Autodesk.Revit.DB.Connector)
Gets all connectors that are valid to be assigned to the part for a specified body connector
connector:
The connector to to check against
Returns:
Returns an array of connector database identifiers
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.FabricationPart.InsulationLiningElementId
The Revit element id of the fabrication insulation or lining, or invalidElementId if the part has no insulation or lining.
Since:
2027

Autodesk.Revit.DB.FabricationPart.HandlePosition
Position of the handle of the fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.FabricationPart.HasHandle
Indicates whether fabrication part has a handle.
Since:
2027